base/ChartsOfAccounts/бит_Бюджетирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>бит_Бюджетирование</Name>
			<Comment>(БИТ)</Comment>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.бит_ВидыСубконтоБюджетирования</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

base/ChartsOfAccounts/бит_Бюджетирование/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Родитель")
			И ЗначениеЗаполнено(ДанныеЗаполнения.Родитель) Тогда
			
			// Заполним по умолчанию значения из родителя.
			Вид            = ДанныеЗаполнения.Родитель.Вид;
			Забалансовый   = ДанныеЗаполнения.Родитель.Забалансовый;
			Количественный = ДанныеЗаполнения.Родитель.Количественный;
			Валютный       = ДанныеЗаполнения.Родитель.Валютный;
			
			ВидыСубконто.Загрузить(ДанныеЗаполнения.Родитель.ВидыСубконто.Выгрузить());
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
	
	
	МаскаКода = РегистрыСведений.бит_МаскиКодов.ПолучитьМаскуКодаПланаСчетов("бит_Бюджетирование");
	Порядок   = РегистрыСведений.бит_МаскиКодов.ПолучитьПорядокКодаПоМаскеКода(МаскаКода, Код);
	
	Если НЕ ЗначениеЗаполнено(КодБыстрогоВыбора) Тогда
		КодБыстрогоВыбора = бит_БухгалтерияКлиентСервер.ПолучитьКодБыстрогоДоступа(Код);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
